def chinaKalendar(year):
#    year = int(input())
    animals = ['Дракон', 'Змея', 'Лошадь', 'Овца', 'Обезьяна', 'Петух', 'Собака', 'Свинья', 'Крыса', 'Бык', 'Тигр', 'Заяц']
    animal_index = (int(year) - 2000) % 12
    animal = animals[animal_index]
    print(animal)

chinaKalendar(input())

'''
s = ['Дракон', 'Змея', 'Лошадь', 'Овца', 'Обезьяна', 'Петух', 'Собака', 'Свинья', 'Крыса', 'Бык', 'Тигр', 'Заяц',]
print(s[(int(input()) - 2000) % 12])

index = (int(input()) + 4) % 12

horoscope = {
    0: 'Дракон',
    1: 'Змея',
    2: 'Лошадь',
    3: 'Овца',
    4: 'Обезьяна',
    5: 'Петух',
    6: 'Собака',
    7: 'Свинья',
    8: 'Крыса',
    9: 'Бык',
    10: 'Тигр',
    11: 'Заяц',
}

print(horoscope[index])

year = int(input())

if (year - 2000) % 12 == 0:
    print('Дракон')
elif (year - 2000) % 12 == 1:
    print('Змея')
elif (year - 2000) % 12 == 2:
    print('Лошадь')
elif (year - 2000) % 12 == 3:
    print('Овца')
elif (year - 2000) % 12 == 4:
    print('Обезьяна')
elif (year - 2000) % 12 == 5:
    print('Петух')
elif (year - 2000) % 12 == 6:
    print('Собака')
elif (year - 2000) % 12 == 7:
    print('Свинья')
elif (year - 2000) % 12 == 8:
    print('Крыса')
elif (year - 2000) % 12 == 9:
    print('Бык')
elif (year - 2000) % 12 == 10:
    print('Тигр')
elif (year - 2000) % 12 == 11:
    print('Заяц')

print(['Обезьяна', 'Петух', 'Собака', 'Свинья', 'Крыса', 'Бык',
   'Тигр', 'Заяц', 'Дракон', 'Змея', 'Лошадь', 'Овца'][int(input()) % 12])

year = int(input())

zodiac = {
          0: 'Обезьяна', 6: 'Тигр',
          1: 'Петух',    7: 'Заяц',
          2: 'Собака',   8: 'Дракон',
          3: 'Свинья',   9: 'Змея',
          4: 'Крыса',    10: 'Лошадь',
          5: 'Бык',      11: 'Овца',
         }

print(zodiac[year % 12])

a=int(input())
d={2000:"Дракон", 2001:"Змея", 2002:"Лошадь", 2003:"Овца", 2004:"Обезьяна", 2005:"Петух", 2006:"Собака", 2007:"Свинья", 2008:"Крыса", 2009:"Бык", 2010:"Тигр", 2011:"Заяц"}
for i in range(2000, 2012):
    if (i-a)%12==0:
        print(d[i])

'''
